# RebarShapeConstraintSagittaLength Class

---
A constraint that can be applied to a RebarShapeDefinitionByArc and drives the height of the arc.
SystemObject Autodesk.Revit.DB.StructureRebarShapeConstraint Autodesk.Revit.DB.StructureRebarShapeConstraintSagittaLength
**Namespace:** Autodesk.Revit.DB.Structure**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

    public class RebarShapeConstraintSagittaLength : RebarShapeConstraint

    Public Class RebarShapeConstraintSagittaLength
    	Inherits RebarShapeConstraint

    public ref class RebarShapeConstraintSagittaLength : public RebarShapeConstraint

    type RebarShapeConstraintSagittaLength =
        class
            inherit RebarShapeConstraint
        end
The RebarShapeConstraintSagittaLength type exposes the following members.
| Name| Description
---|---|---
| RebarShapeConstraintSagittaLength|  Create a constraint to drive sagitta length.
Top
| Name| Description
---|---|---
| IsValidObject|  Specifies whether the .NET object represents a valid Revit entity. (Inherited from RebarShapeConstraint)
Top
| Name| Description
---|---|---
| Dispose| (Inherited from RebarShapeConstraint)
| Equals| Determines whether the specified object is equal to the current object.(Inherited from Object)
| GetHashCode| Serves as the default hash function.(Inherited from Object)
| GetParamId|  Return the Id of the parameter associated with this constraint. (Inherited from RebarShapeConstraint)
| GetType| Gets the Type of the current instance.(Inherited from Object)
| ToString| Returns a string that represents the current object.(Inherited from Object)
Top
#### Reference
Autodesk.Revit.DB.Structure Namespace